{"blog_id": "1607.05690", "summary": ["This paper derives an algorithm for passing gradients through a sample from a mixture of Gaussians.", "While the reparameterization trick allows to get the gradients with respect to the Gaussian means and covariances, the same trick cannot be invoked for the mixing proportions parameters (essentially because they are the parameters of a multinomial discrete distribution over the Gaussian components, and the reparameterization trick doesn't extend to discrete distributions).", "One can think of the derivation as proceeding in 3 steps:  1.", "Deriving an estimator for gradients a sample from a 1-dimensional density $f(x)$ that is such that $f(x)$ is differentiable and its cumulative distribution function (CDF) $F(x)$ is tractable:    $\\frac{\\partial \\hat{x}}{\\partial \\theta} = - \\frac{1}{f(\\hat{x})}\\int_{t=-\\infty}^{\\hat{x}} \\frac{\\partial f(t)}{\\partial \\theta} dt$    where $\\hat{x}$ is a sample from density $f(x)$ and $\\theta$ is any parameter of $f(x)$ (the above is a simplified version of Equation 6).", "This is probably the most important result of the paper, and is based on a really clever use of the general form of the Leibniz integral rule.", "2.", "Noticing that one can sample from a $D$-dimensional Gaussian mixture by decomposing it with the product rule $f({\\bf x}) = \\prod_{d=1}^D f(x_d|{\\bf x}_{<d})$ and using ancestral sampling, where each $f(x_d|{\\bf x}_{<d})$ are themselves 1-dimensional mixtures (i.e. with differentiable densities and tractable CDFs)  3.", "Using the 1-dimensional gradient estimator (of Equation 6) and the chain rule to backpropagate through the ancestral sampling procedure.", "This requires computing the integral in the expression for $\\frac{\\partial \\hat{x}}{\\partial \\theta}$ above, where $f(x)$ is one of the 1D conditional Gaussian mixtures and $\\theta$ is a mixing proportion parameter $\\pi_j$.", "As it turns out, this integral has an analytical form (see Equation 22).", "**My two cents**  This is a really surprising and neat result.", "The author mentions it could be applicable to variational autoencoders (to support posteriors that are mixtures of Gaussians), and I'm really looking forward to read about whether that can be successfully done in practice.", "The paper provides the derivation only for mixtures of Gaussians with diagonal covariance matrices.", "It is mentioned that extending to non-diagonal covariances is doable.", "That said, ancestral sampling with non-diagonal covariances would become more computationally expensive, since the conditionals under each Gaussian involves a matrix inverse.", "Beyond the case of Gaussian mixtures, Equation 6 is super interesting in itself as its application could go beyond that case.", "This is probably why the paper also derived a sampling-based estimator for Equation 6, in Equation 9.", "However, that estimator might be inefficient, since it involves sampling from Equation 10 with rejection, and it might take a lot of time to get an accepted sample if $\\hat{x}$ is very small.", "Also, a good estimate of Equation 6 might require *multiple* samples from Equation 10.", "Finally, while I couldn't find any obvious problem with the mathematical derivation, I'd be curious to see whether using the same approach to derive a gradient on one of the Gaussian mean or standard deviation parameters gave a gradient that is consistent with what the reparameterization trick provides."], "author_id": "hlarochelle", "pdf_url": "http://arxiv.org/pdf/1607.05690v1", "author_full_name": "Hugo Larochelle", "source_website": "https://www.shortscience.org/user?name=hlarochelle", "id": 16280529}