{"blog_id": "a-first-look-at-the-usabilty-of-bitcoin-key-management", "summary": ["A first look at the usability of Bitcoin key management Eskandari et al., USEC 2015  This is the third of five papers from the ACM Queue Research for Practice selections on ‘ Cryptocurrencies, Blockchains, and Smart Contracts .’ And thankfully it’s much easier to read and understand than yesterdays!", "The authors point out that a cryptocurrency intended for use by the general public also needs a means by which the general public can come to understand and manage collections of public and private keys.", "To date, this has proved elusive.", "As the authors of “ Why Johnny Can’t Encrypt ” point out, “Security mechanisms are effective only when used correctly.” One of the interesting takeaways for me is that the familiar metaphors of ‘coin’ and ‘password’ can harm as much as they help.", "In all of the excitement surrounding Bitcoin, it is easy to forget that the decentralized currency assumes a solution to the longstanding problem of usable public key cryptography for user authentication.", "If you lose a Bitcoin private key, you lose the monetary value of the coins it protects.", "Moreover, Bitcoin users typically have no legal protection against loss or theft.", "So can we find a safe, usable key management approach for novice users?", "The findings from previous studies on the usability of public key cryptography include:  The metaphor and terminology behind public and private keys is confusing  It is difficult to correctly obtain other user’s public keys  Key migration between devices is difficult  Many of the confusions seem to stem from the fact that users are used to passwords for protecting information, and public/private key pairs don’t fit neatly into that mental model.", "The main bulk of the paper compares and contrasts six different approaches to Bitcoin key management, followed by a more detailed usability study of six actual Bitcoin clients, one from each category.", "Six approaches to Bitcoin key management  Here are six different approaches that you might use for managing private keys:  Keep them on device local storage.", "Bitcoin Core uses this approach.", "It’s easy, but vulnerable to malware since the file storing private keys can be read by any process with applications to the user’s folder.", "Private-key stealing malware has been known since at least 2011.", "Users need to be very careful not to inadvertently share this folder outside of their computer, but at the same time they need to periodically create new backups of the key storage file to ensure that new keypool keys are stored.", "Use a password-protected encrypted wallet.", "MultiBit uses this approach.", "These solutions encrypt the key storage file that is held on device local storage.", "The user is therefore protected against theft of the file (to the degree the password cannot be cracked), but malware on the machine will still be able to use e.g. a keystroke logger to capture the password.", "“Password-protected wallets may mislead the user to believe that the password itself provides access to their funds regardless of the location of the device storing the wallet.", "Offline storage of keys (e.g., Bitaddress) To protect against malware-based threats, wallets can be stored offline on portable media (e.g., a USB drive).", "Of course, this makes the wallet unavailable for immediate use, and the wallet is still exposed and potentially vulnerable to malware when mounted on a computational device.", "An interesting example here is paper wallets (e.g. [url]"], "author_id": "ACOLYER", "pdf_url": "http://users.encs.concordia.ca/~clark/papers/2015_usec.pdf", "author_full_name": "Adrian Colyer", "source_website": "https://blog.acolyer.org/about/", "id": 78841597}