{"blog_id": "distributed-consensus-and-the-implications-of-nvm-on-database-management-systems", "summary": ["Distributed consensus and the implications of NVM on database management systems Fournier, Arulraj, & Pavlo ACM Queue Vol 14, issue 3  As you may recall, Peter Bailis and ACM Queue have started a “Research for Practice” series introducing “expert curated guides to the best of CS research.” Aka, reading lists for The Morning Paper!", "I previously covered the papers from the first edition (blog entries dated June 14th-21st, 2016).", "Today we’re turning our attention to the the second edition:  I am thrilled to introduce our second instalment of Research for Practice, which provides highlights from two critical areas in storage and large-scale services: distributed consensus and non-volatile memory.", "Distributed consensus  The first topic area is Distributed Consensus, with papers selected by Camille Fournier.", "“The three papers included in this selection address the real world of consensus system: Why are they needed?", "Why are they difficult to understand?", "What happens when you try to implement.", "Them?", "Is there an easier way, something that more developers can understand and therefore implement?”  Fournier’s three choices are:  Paxos made live – an engineering perspective  The Chubby lock service for loosely coupled distributed systems  In search of an understandable consensus algorithm  All of which will be familiar to regular readers of The Morning Paper ;) (Links above are to my write-ups).", "If you want more of this kind of thing, I did a two-week mini-series on consensus back in March of last year.", "Here are three additional picks of my own:  Viewstamped Replication Revisited  Raft Refloated  And yesterday’s paper, Flexible Paxos  Implications of NVM on database management systems  Joy Arulrja and Andrew Pavlo introduce a selection of three papers looking at the implications of NVM for database management systems:  The advent of non-volatile memory (NVM) will fundamentally change the dichotomy between memory and durable storage in a database management systems (DBMS).", "This is a topic area that really caught my attention earlier this year, and I wrote a short post entitled “ All change please ” summarizing some of the hardware advances hitting our data centers, including NVM.", "On the subject of NVM itself and its implications, the papers I’ve covered so far can be found by searching on the blog for the keyword ‘NVM’ .", "The first of Arulja and Pavlo’s picks is  From ARIES to MARS  Which looks at the classic ARIES recovery protocol and how it can be optimized for NVM.", "Their second and third paper choices are ones that I haven’t covered before.", "So we’ll be looking at those papers in the next two days.", "The links below will go live as each days’ post goes up.", "Let’s talk about storage and recovery methods for non-volatile memory database systems – a wonderful tour of common DBMS storage engine designs, and how they can be adapted to NVM.", "How did I miss this paper first time around???", "It’s a real gem.", "Write-limited sorts and joins for persistent memory , which looks at the implications of read/write cost imbalance and limited write endurance in NVM.", "As Arulja and Pavlo say,  The common theme for these papers is that you cannot just run an existing DBMS on NVM and expect it to leverage its unique set of properties.", "The only way to achieve that is to come up with novel architectures, protocols, and algorithms that are tailor-made for NVM.", "The third edition of Reseach for Practice must be due out soon – I’m very much looking forward to seeing where it goes next!"], "author_id": "ACOLYER", "pdf_url": "https://dl.acm.org/doi/pdf/10.1145/2956641.2967618?download=true", "author_full_name": "Adrian Colyer", "source_website": "https://blog.acolyer.org/about/", "id": 27051635}