{"blog_id": "towards-usable-checksums-automating-the-integrity-verification-of-web-downloads-for-the-masses", "summary": ["Towards usable checksums: automating the integrity verification of web downloads for the masses Cherubini et al., CCS’18  If you tackled Monday’s paper on BEAT you deserve something a little easier to digest today, and ‘Towards usable checksums’ fits the bill nicely!", "There’s some great data-driven product management going on here as the authors set out to quantify current attitudes and behaviours regarding downloading files from the Internet, design a solution to improve security and ease-of-use, and then test their solution to gather feedback and prepare for a more widely deployed beta version.", "When I was growing up we were all taught “Don’t talk to strangers”, and “Never get in a stranger’s car”.", "As has been well noted by others, so much for that advice!", "Perhaps the modern equivalent is “Don’t download unknown files from the Internet!” This paper specifically looks at applications made directly available from developer websites (vs downloads made through app stores).", "A popular and convenient way to download programs is to use official app stores such as Apple’s Mac App Store and Microsoft’s Windows Store.", "Such platforms, however, have several drawbacks for developers, including long review and validation times, technical restrictions (e.g., sandboxing), incompatibility with software licenses, and substantial commissions.", "Therefore, it is quite common that developers make their programs available directly from their websites.", "This is the case of popular programs such as VLC media player, OpenOffice, and GIMP.", "If you’re reading The Morning Paper, you probably know what a checksum is for and how to use it to verify the integrity of a download.", "You’re probably also well aware of the importance of doing so.", "Even so, I wouldn’t be surprised if on at least one occasion it’s been too awkward / you’ve been in too much of a hurry to get some other task done you’re focused on / you rated the risk as low enough, and so on, that you failed to do so.", "I’ve seen up close the apparent struggles of very bright professional people without IT backgrounds to manage basics such as passwords.", "I hold out little hope of them navigating checksums— from “What’s a command-line?” on up— even though I know they’re more than capable of understanding if only it seemed sufficiently important to them.", "Yet checksums are an important line of defence to protect against adversaries tampering files to inject malware etc..  A popular way for developers to enable users to detect accidental or intentional modifications of their program files hosted on external platforms, such as mirrors and CDNs, is to provide so-called checksums on their websites.", "This practice is quite common in the open-source community but also for companies such as Google…  For a restricted subset of downloadable assets -chiefly JavaScript and style sheets, included via script and link tags, integrated checksum support is available via the Subresource Integrity (SRI) specification introduced by the W3C in 2016.", "It’s supported by all major browsers (including Edge, but not IE).", "If you’re not already using it for externally hosted assets you include in your site then you really should look into it.", "Here’s an example of the integrity attribute in action, taken from the MDN site:  <script src=\" [url]"], "author_id": "ACOLYER", "pdf_url": "https://dl.acm.org/doi/pdf/10.1145/3243734.3243746?download=true", "author_full_name": "Adrian Colyer", "source_website": "https://blog.acolyer.org/about/", "id": 57228237}