{"blog_id": "1605.06065", "summary": ["This paper proposes a variant of Neural Turing Machine (NTM) for meta-learning or \"learning to learn\", in the specific context of few-shot learning (i.e. learning from few examples).", "Specifically, the proposed model is trained to ingest as input a training set of examples and improve its output predictions as examples are processed, in a purely feed-forward way.", "This is a form of meta-learning because the model is trained so that its forward pass effectively executes a form of \"learning\" from the examples it is fed as input.", "During training, the model is fed multiples sequences (referred to as episodes) of labeled examples $({\\bf x}_1, {\\rm null}), ({\\bf x}_2, y_1), \\dots, ({\\bf x}_T, y_{T-1})$, where $T$ is the size of the episode.", "For instance, if the model is trained to learn how to do 5-class classification from 10 examples per class, $T$ would be $5 \\times 10 = 50$.", "Mainly, the paper presents experiments on the Omniglot dataset, which has 1623 classes.", "In these experiments, classes are separated into 1200 \"training classes\" and 423 \"test classes\", and each episode is generated by randomly selecting 5 classes (each assigned some arbitrary vector representation, e.g. a  one-hot vector that is consistent within the episode, but not across episodes) and constructing a randomly ordered sequence of 50 examples from within the chosen 5 classes.", "Moreover, the correct label $y_t$ of a given input ${\\bf x}_t$ is always provided only at the next time step, but the model is trained to be good at its prediction of the label of ${\\bf x}_t$ at the current time step.", "This is akin to the scenario of online learning on a stream of examples, where the label of an example is revealed only once the model has made a prediction.", "The proposed NTM is different from the original NTM of Alex Graves, mostly in how it writes into its memory.", "The authors propose to focus writing to either the least recently used memory location or the most recently used memory location.", "Moreover, the least recently used memory location is reset to zero before every write (an operation that seems to be ignored when backpropagating gradients).", "Intuitively, the proposed NTM should learn a strategy by which, given a new input, it looks into its memory for information from other examples earlier in the episode (perhaps similarly to what a nearest neighbor classifier would do) to predict the class of the new input.", "The paper presents experiments in learning to do multiclass classification on the Omniglot dataset and regression based on functions synthetically generated by a GP.", "The highlights are that:  1.", "The proposed model performs much better than an LSTM and better than an NTM with the original write mechanism of Alex Graves (for classification).", "2.", "The proposed model even performs better than a 1st nearest neighbor classifier.", "3.", "The proposed model is even shown to outperform human performance, for the 5-class scenario.", "4.", "The proposed model has decent performance on the regression task, compared to GP predictions using the groundtruth kernel.", "**My two cents**  This is probably one of my favorite ICML 2016 papers.", "I really think meta-learning is a problem that deserves more attention, and this paper presents both an interesting proposal for how to do it and an interesting empirical investigation of it.", "Much like previous work [\\[1\\]][1] [\\[2\\]][2], learning is based on automatically generating a meta-learning training set.", "This is clever I think, since a very large number of such \"meta-learning\" examples (the episodes) can be constructed, thus transforming what is normally a \"small data problem\" (few shot learning) into a \"big data problem\", for which deep learning is more effective.", "I'm particularly impressed by how the proposed model outperforms a 1-nearest neighbor classifier.", "That said, the proposed NTM actually performs 4 reads at each time step, which suggests that a fairer comparison might be with a 4-nearest neighbor classifier.", "I do wonder how this baseline would compare.", "I'm also impressed with the observation that the proposed model surpassed humans.", "The paper also proposes to use 5-letter words to describe classes, instead of one-hot vectors.", "The motivation is that this should make it easier for the model to scale to much more than 5 classes.", "However, I don't entirely follow the logic as to why one-hot vectors are problematic.", "In fact, I would think that arbitrarily assigning 5-letter words to classes would instead imply some similarity between classes that share letters that is arbitrary and doesn't reflect true class similarity.", "Also, while I find it encouraging that the performance for regression of the proposed model is decent, I'm curious about how it would compare with a GP approach that incrementally learns the kernel's hyper-parameter (instead of using the groundtruth values, which makes this baseline unrealistically strong).", "Finally, I'm still not 100% sure how exactly the NTM is able to implement the type of feed-forward inference I'd expect to be required.", "I would expect it to learn a memory representation of examples that combines information from the input vector ${\\bf x}_t$ *and* its label $y_t$.", "However, since the label of an input is presented at the following time step in an episode, it is not intuitive to me then how the read/write mechanisms are able to deal with this misalignment.", "My only guess is that since the controller is an LSTM, then it can somehow remember ${\\bf x}_t$ until it gets $y_t$ and appropriately include the combined information into the memory.", "This could be supported by the fact that using a non-recurrent feed-forward controller is much worse than using an LSTM controller.", "But I'm not 100% sure of this either.", "All the above being said, this is still a really great paper, which I hope will help stimulate more research on meta-learning.", "Hopefully code for this paper can eventually be released, which would help in popularizing the topic.", "[1]:  [url]"], "author_id": "hlarochelle", "pdf_url": "http://arxiv.org/pdf/1605.06065v1", "author_full_name": "Hugo Larochelle", "source_website": "https://www.shortscience.org/user?name=hlarochelle", "id": 45612165}