{"blog_id": "towards-deploying-decommissioned-mobile-devices-as-cheap-energy-efficient-compute-nodes", "summary": ["Towards deploying decommissioned mobile devices as cheap energy-efficient compute nodes Shahrad & Wentzlaff, HotCloud’17  I have one simple rule when it comes to selecting papers for The Morning Paper: I only cover papers that I like and find interesting.", "There are some papers though, that manage to generate in me a genuine feeling of excitement, as in “this is so cool, I can’t wait to share it.” This is one of those papers!", "You may remember back in 2010 when the US Air Force had the breakthrough idea to create a supercomputer out of 1,760 Sony Playstations .", "Well, Shahrad & Wentzlaff want us to pack our data centers with racks of decommissioned mobile phones!", "The case they put forward is both fascinating and compelling.", "Firstly, there are a lot of old mobile phones, and the mobile system on chips (SoCs) inside them have been gaining in power while having a low TCO.", "Secondly, it’s possible to pack a number of them in a 2U unit.", "Thirdly, there are a number of use cases for which such a collection of wimpy nodes seem well suited.", "And finally of course, it’s a wonderfully green way of recycling older devices that may e.g., have cracked screens, sluggish software etc..", "Deploying decommissioned mobile devices can be a major move towards green computing.", "This is mostly due to the fact that most of the carbon footprint of those devices comes from their production.", "Such deployment extends effective lifetime of mobile devices and decreases their average global warming potential (GWP), benefiting the environment.", "Are mobile phones really powerful enough to be useful in a data center?", "Both industry and academia already have their eye on mobile SoCs as the next most cost-effective platform in HPC – the gap between mobile SoCs and commodity server processors is shrinking and their TCO is much lower.", "If you look at mobile SoC performance for the last five years, something very interesting shows up:  (What a lovely s-curve example btw.).", "Moore’s law is kicking in, and the performance gap between a new and 3-year old device will shrink  The relative performance gap between high-end and low-end SoCs is shrinking, leading to similar performance on a cheaper device.", "Mobile CPU single core thermal design point has saturated at around 1.5W, so the performance power budget should stay steady as devices scale.", "Meanwhile, newer devices actually have slightly lower energy efficiency as they push for the last reserves of power.", "So decommissioned devices will actually have better overall energy efficiency.", "What applications could you run on a bunch of old phones?", "Due to their energy efficiency and improved performance, ARM-based architectures have recently gained substantial attention for HPC and cloud infrastructure deployment.", "ARM multicores deliver good energy proportionality for server workloads.", "Here are some promising use cases:  I/O intensive applications that are unable to saturate their CPU.", "Modern mobile SoCs support high bandwidth I/O and ample RAM size so I/O intensive applications can run on them with less I/O-CPU mismatch.", "Will your next VM be running on a decommissioned mobile phone?", "Low-end VMs on Amazon EC2 burstable t2.nano and t2.micro have 0.5GB and 1GB of memory respectively.", "Common hypervisors (KVM, Xen, …) support virtualizing ARM and an average mobile device has more than 2GB of memory – so a cloud provider could assign multiple such instances to each device!", "Applications requiring low-end GPU acceleration for platforms such as OpenCL.", "A SoC’s GPU can be shared between multiple tenants.", "Increasing the heterogeneity of cloud infrastructure to diversify reliability.", "How do you efficiently install mobile phone arrays inside a data center?", "The authors’ proposed design shows that decommissioned mobile devices can be housed in standard server racks.", "With three rows of fans, a network router, and a power supply, there is room for 84 cages (smartphones) of a size that fits more than 75% of models (notably excluding tablets!).", "With an average of 5.6 CPU cores per device, that adds up to about 470 cores in a 2U server box.", "Networking can be achieved either with a USB tree and shared master node, or USB on-the-go to each device.", "The latter will give much higher network performance, but requires more network switches.", "The phones come with another advantage that we get for free – batteries!", "Researchers have proposed using distributed UPSs or batteries to shave peak power in data centers.", "This allows installing more servers using the same power infrastructure and decreases the TCO… Distributed batteries effectively dampen temporal power demand variations; shaving the peak power under high utilization, while storing energy under low utilization.", "The high energy storage density enables more aggressive power capping of servers that are filled with used mobile devices.", "Even assuming 15% battery degradation per year, the capacity will be 4-8x denser than purpose designed distributed UPS solutions.", "Is it cost effective?", "We’ve seen that in theory racks of decommissioned mobile devices can be done, and we’ve seen that there are some potential use cases for such systems.", "But does it make financial sense??", "The authors choose the Samsung Galaxy Note 4 as a representative three-year old device, and match it against a Lenovo Flex System x880 X6 which has similar performance as 84 Note 4s.", "CAPEX and OPEX work out as follows (the authors assumed that the monitoring engineering, and installation cost of the mobile array is twice that of a standard server):  A TCO analysis shows that the mobile array beats the traditional server on TCO by some margin.", "(In the figures below ‘A’ is the traditional server, ‘B’ is the mobile array, and &delta; is the depreciation rate).", "The right sub-figures in Figure 5 (above) compare TCO when those two servers have different lifetimes.", "This analysis is essential for a fair comparison because we anticipate our proposed server to have a shorter lifetime compared to a new high-end server.", "It can be seen that with much shorter lifetimes, our proposed server can deliver better TCO values.", "It also shows how the equal-TCO margin (the line between light and dark areas) varies for different depreciation rates."], "author_id": "ACOLYER", "pdf_url": "https://www.usenix.org/system/files/conference/hotcloud17/hotcloud17-paper-shahrad.pdf", "author_full_name": "Adrian Colyer", "source_website": "https://blog.acolyer.org/about/", "id": 31459000}