{"blog_id": "three-years-of-the-right-to-be-forgotten", "summary": ["Three years of the Right To Be Forgotten Bertram et al., 2018  With thanks to Elie Bursztein for bringing this paper to my attention.", "See also Elie’s blog post ‘ Insights about the first three years of the Right To Be Forgotten requests at Google .’  Following on from the GDPR we looked at yesterday, and which comes into force in May of this year, I thought it would be interesting to take a look at another right to be forgotten (RTBF) that has been in force since May 2014.", "Today’s paper choice is a retrospective study from Google of the 2.4M URLs that were requested for delisting from the Google search engine over the last 3 and a half years.", "This particular right to be forgotten enables individuals to request that search engines delist URLs containing “inaccurate, inadequate, irrelevant or excessive” information surfaced by queries containing the name of the requestor.", "Critically, the ruling requires that search engine operators make the determination for whether an individual’s right to privacy outweighs the public’s right to access lawful information when delisting URLs.", "That’s a lot of responsibility to place with private groups within search engine companies!", "Google formed an advisory council drawn from academic scholars, media producers, data protection authorities, civil society, and technologists to establish decision criteria for “particularly challenging delisting requests.”  Google make a RTBF submission form available online.", "Requestors must verify their identity and provide a list of URLs they would like to delist along with the search queries leading to those URLs and a short comment about how the URLs relate to the requestor.", "Every submission is manually reviewed – there is no automation in the decision process.", "The reviewers consider four criteria, designed to weigh public interest against the requestor’s personal privacy:  The validity of the request: is it actionable (e.g., specifies exact URLs) and is the requestor connected with an EU/EEA country.", "The identity of the requestor: for example, if the requestor is a public figure there may be heightened public interest.", "Other categories of interest include minors, politicians, and professionals.", "The content referenced by the URL.", "“For example, information related to a requestor’s business may be of public interest for potential customers.", "Similarly, content related to a violent crime may be of interest to the general public… “  The source of the information: e.g., government site, news site, blog, or forum.", "For the period between May 30th 2014, and December 31st 2017, Google received requests to delist almost 2.4M URLs, from 399,779 unique requestors.", "Only 43% of these URLs were ultimately delisted.", "From January 22nd 2016, requested URLs were additionally annotated with categorical data for purposes of improving transparency around RTBF requests.", "Applying judgement  The paper contains a sprinkling of anonymous requests and the decisions reached, which provide good insight into the challenges the reviewers face.", "Here are some examples:  “… an individual, who was convicted for two separate instances of domestic violence within the previous five years, sent Google a delisting request focusing on the fact that their first conviction was ‘spent’ under local law.", "The requestor did not disclose that the second conviction was not similarly spent, and falsely attributed all the pages sought for delisting to the first conviction.", "Reviewers discovered this as part of the review process and the request was ultimately rejected.”  “In another case, reviewers first delisted 150 URLs submitted by a businessman who was convicted for benefit fraud, after they provided documentation confirming their acquittal.", "When the same person later requested the delisting of URLs related to a conviction for manufacturing court documents about their acquittal, reviewers evaluated the acquittal documentation sent to Google, found it to be a forgery, and reinstated all previously delisted URLs”.", "“…a requestor who held a significant position at a major company sought to delist an article about receiving a long prison sentence for attempted fraud.", "Google rejected this request due to the seriousness of the crime and the professional relevance of the content.”  “…an individual sought to delist an interview they conducted after surviving a terrorist attack.", "Despite the article’s self-authored nature given the requestor was interviewed [note the assumption here that the journalist gave a fair impression of what the interviewee actually said!", "], Google delisted the URL as the requestor was a minor and because of the sensitive nature of the content.”  “… a requestor sought to delist a news article about their acquittal for domestic violence on the grounds that no medical report was presented to the judge confirming the victim’s injuries.", "Given that the requestor was acquitted, Google delisted the article.", "**”  Welcome to the court of social reputation!", "How often are requests made and who makes them?", "Overall, the number of RTBF requests per month has been slowly declining after an initial peak when the facility was first launched.", "The number of previously unseen requestors per month is also declining.", "The most requests originate in France, Germany, and the United Kingdom, though if we look at per capita rates Estonia tops the table.", "Most interestingly, reputation management is clearly a growing business (see also Black Mirror: ‘nosedive’):  The top thousand requesters (0.25% of all requesters) generated 14.6% of requests and 20.8% of delistings.", "These mostly included law firms and reputation management agencies, as well as some requestors with a sizable online presence… while hundreds of thousands of Europeans rely on the RTBF to delist a handful of URLs, there are thousands of entities using the RTBF to alter hundreds of URLs about them or their clients that appear in search results.", "Most requested for delisting, by an order of magnitude,  are URLs concerning private individuals:  Requests predominantly come from private individuals (88%).", "Politicians and government officials requested delisting of 33,937 URLs, and non-governmental public figures another 41,213 URLs.", "Over 77% of requests to delist URLs rooted in a country code top-level domain come from requestors in the same country.", "Requests now take a median of 4 days to process.", "What content do people request delisting for?", "The major categories of sites that contains URLs targeted for delisting are social media sides, directory sites aggregating contact details and personal content, and news sites.", "It seems that people don’t want you to read bad things about them on Facebook!", "Here are the most requested sites by category:  Different countries show different characteristics, which can be explained by, for example, the character of the news organisations in those countries, and the role of the government in publishing information.", "In Italy and the UK, requestors target news media much more than in Germany and France for example.", "Journalists in the former countries are prone to reveal the identity of individuals, whereas those in the latter tend to anonymise parties in their coverage of crimes.", "Requestors in France and Germany target social media and directory services more than average.", "In Spain there is a higher proportion of requests targeting government records.", "Spanish law requires the government to publish ‘edictos’ and ‘indultos.’ “_The former are public notifications to inform missing individuals about a government decision that directly affects them; the latter are government decisions to absolve an individual from a criminal sentence or to commute to a lesser one.”  Looking at the content at the URLs requested for delisting, we find that most pages contain professional information, though it’s interesting to see self-authored content in the number two spot!", "The most commonly requested content related to professional information, which rarely met the criteria for delisting (16.7%).", "Many of these requests pertain to information which is directly relevant or connected to the requestor’s current profession and is therefore in the public interest to have indexed in Google Search."], "author_id": "ACOLYER", "pdf_url": "https://www.elie.net/static/files/three-years-of-the-right-to-be-forgotten/three-years-of-the-right-to-be-forgotten-paper.pdf", "author_full_name": "Adrian Colyer", "source_website": "https://blog.acolyer.org/about/", "id": 13793499}