{"blog_id": "balanrmw15", "summary": ["This paper combines two ideas.", "The first is stochastic gradient Langevin dynamics (SGLD), which is an efficient Bayesian learning method for larger datasets, allowing to efficiently sample from the posterior over the parameters of a model (e.g. a deep neural network).", "In short, SGLD is stochastic (minibatch) gradient descent, but where Gaussian noise is added to the gradients before each update.", "Each update thus results in a sample from the SGLD sampler.", "To make a prediction for a new data point, a number of previous parameter values are combined into an ensemble, which effectively corresponds to Monte Carlo estimate of the posterior predictive distribution of the model.", "The second idea is distillation or dark knowledge, which in short is the idea of training a smaller model (student) in replicating the behavior and performance of a much larger model (teacher), by essentially training the student to match the outputs of the teacher.", "The observation made in this paper is that the step of creating an ensemble of several models (e.g. deep networks) can be expensive, especially if many samples are used and/or if each model is large.", "Thus, they propose to approximate the output of that ensemble by training a single network to predict to output of ensemble.", "Ultimately, this is done by having the student predict the output of a teacher corresponding to the model with the last parameter value sampled by SGLD.", "Interestingly, this process can be operated in an online fashion, where one alternates between sampling from SGLD (i.e. performing a noisy SGD step on the teacher model) and performing a distillation update (i.e.", "updating the student model, given the current teacher model).", "The end result is a student model, whose outputs should be calibrated to the bayesian predictive distribution."], "author_id": "hlarochelle", "pdf_url": "http://papers.nips.cc/paper/5965-bayesian-dark-knowledge.pdf", "author_full_name": "Hugo Larochelle", "source_website": "https://www.shortscience.org/user?name=hlarochelle", "id": 3517250}