{"blog_id": "chengs15", "summary": ["This paper presents an approach to initialize a neural network from the parameters of a smaller and previously trained neural network.", "This is effectively done by increasing the size (in width and/or depth) of the previously trained neural network, in such of a way that the function represented by the network doesn't change (i.e. the output of the larger neural network is still the same).", "The motivation here is that initializing larger neural networks in this way allows to accelerate their training, since at initialization the neural network will already be quite good.", "In a nutshell, neural networks are made wider by adding several copies (selected randomly) of the same hidden units to the hidden layer, for each hidden layer.", "To ensure that the neural network output remains the same, each incoming connection weight must also be divided by the number of replicas that unit is connected to in the previous layer.", "If not training using dropout, it is also recommended to add some noise to this initialization, in order to break its initial symmetry (though this will actually break the property that the network's output is the same).", "As for making a deeper network, layers are added by initializing them to be the identity function.", "For ReLU units, this is achieved using an identity matrix as the connection weight matrix.", "For units based on sigmoid or tanh activations, unfortunately it isn't possible to add such identity layers.", "In their experiments on ImageNet, the authors show that this initialization allows them to train larger networks faster than if trained from random initialization.", "More importantly, they were able to outperform their previous validation set ImageNet accuracy by initializing a very large network from their best Inception network."], "author_id": "hlarochelle", "pdf_url": "http://arxiv.org/pdf/1511.05641", "author_full_name": "Hugo Larochelle", "source_website": "https://www.shortscience.org/user?name=hlarochelle", "id": 17980043}