{"blog_id": "cooijmansblc16", "summary": ["This paper describes how to apply the idea of batch normalization (BN) successfully to recurrent neural networks, specifically to LSTM networks.", "The technique involves the 3 following ideas:  **1) Careful initialization of the BN scaling parameter.", "** While standard practice is to initialize it to 1 (to have unit variance), they show that this situation creates problems with the gradient flow through time, which vanishes quickly.", "A value around 0.1 (used in the experiments) preserves gradient flow much better.", "**2) Separate BN for the \"hiddens to hiddens pre-activation and for the \"inputs to hiddens\" pre-activation.", "** In other words, 2 separate BN operators are applied on each contributions to the pre-activation, before summing and passing through the tanh and sigmoid non-linearities.", "**3) Use of largest time-step BN statistics for longer test-time sequences.", "** Indeed, one issue with applying BN to RNNs is that if the input sequences have varying length, and if one uses per-time-step mean/variance statistics in the BN transformation (which is the natural thing to do), it hasn't been clear how do deal with the last time steps of longer sequences seen at test time, for which BN has no statistics from the training set.", "The paper shows evidence that the pre-activation statistics tend to gradually converge to stationary values over time steps, which supports the idea of simply using the training set's last time step statistics.", "Among these ideas, I believe the most impactful idea is 1).", "The papers mentions towards the end that improper initialization of the BN scaling parameter probably explains previous failed attempts to apply BN to recurrent networks.", "Experiments on 4 datasets confirms the method's success.", "**My two cents**  This is an excellent development for LSTMs.", "BN has had an important impact on our success in training deep neural networks, and this approach might very well have a similar impact on the success of LSTMs in practice."], "author_id": "hlarochelle", "pdf_url": "http://arxiv.org/pdf/1603.09025", "author_full_name": "Hugo Larochelle", "source_website": "https://www.shortscience.org/user?name=hlarochelle", "id": 687757}