{"blog_id": "oordkk16", "summary": ["This paper explores the use of convolutional (PixelCNN) and recurrent units (PixelRNN) for modeling the distribution of images, in the framework of autoregression distribution estimation.", "In this framework, the input distribution $p(x)$ is factorized into a product of conditionals $\\Pi p(x_i | x_i-1)$.", "Previous work has shown that very good models can be obtained by using a neural network parametrization of the conditionals (e.g. see our work on NADE  [ref] ).", "Moreover, unlike other approaches based on latent stochastic units that are directed or undirected, the autoregressive approach is able to compute log-probabilities tractably.", "So in this paper, by considering the specific case of x being an image, they exploit the topology of pixels and investigate appropriate architectures for this.", "Among the paper's contributions are:  1.", "They propose Diagonal BiLSTM units for the PixelRNN, which are efficient (thanks to the use of convolutions) while making it possible to, in effect, condition a pixel's distribution on all the pixels above it (see Figure 2 for an illustration).", "2.", "They demonstrate that the use of residual connections (a form of skip connections, from hidden layer i-1 to layer $i+1$) are very effective at learning very deep distribution estimators (they go as deep as 12 layers).", "3.", "They show that it is possible to successfully model the distribution over the pixel intensities (effectively an integer between 0 and 255) using a softmax of 256 units.", "4.", "They propose a multi-scale extension of their model, that they apply to larger 64x64 images.", "The experiments show that the PixelRNN model based on Diagonal BiLSTM units achieves state-of-the-art performance on the binarized MNIST benchmark, in terms of log-likelihood.", "They also report excellent log-likelihood on the CIFAR-10 dataset, comparing to previous work based on real-valued density models.", "Finally, they show that their model is able to generate high quality image samples."], "author_id": "hlarochelle", "pdf_url": "http://arxiv.org/pdf/1601.06759", "author_full_name": "Hugo Larochelle", "source_website": "https://www.shortscience.org/user?name=hlarochelle", "id": 435175}