{"blog_id": "enabling-blockchain-innovations-with-pegged-sidechains", "summary": ["Enabling blockchain innovations with pegged sidechains – Back et al. 2014  A very topical choice today.", "Last week a number of key players in the Bitcoin ecosystem published a paper (see link above) discussing a mechanism (‘pegged sidechains’) to allowed continued innovation and evolution of Bitcoin and related blockchain-based solutions.", "From the abstract:  Since the introduction of Bitcoin in 2009, and the multiple computer science and electronic cash innovations it brought, there has been great interest in the potential of decentralised cryptocurrencies.", "At the same time,  implementation changes to the consensus-critical parts of Bitcoin must necessarily be handled very conservatively.", "As a result, Bitcoin has greater difficulty than other internet protocols adapting to new demands and accommodating new innovation.", "An early solution to the problem of innovation was the development of alternative blockchains, altchains, which modify the bitcoin codebase in some way.", "The deep security expertise needed to do this right has lead to a situation where  we have seen a volatile, non-navigable environment develop, where the most visible projects may be the least technically sound.", "What kinds of innovation are being held back by this current situation?", "Back et al. list six different categories, including:  * exploration of trade-offs between block size and transaction rate, and between security and cost – it would be nice to be able to make these trade-offs per transaction as transactions vary in value and risk-profile  * trading of assets other than currencies on blockchains  * enhanced privacy and censorship-resistance  privacy and censorship-resistance could be improved by use of cryptographic accumulators,  ring signatures, or Chaumian blinding  (that’s a few ‘unknown unknowns’ that just became ‘known unknowns’ for me ;).", "Perhaps something to investigate in future editions of #themorningpaper ).", "We desire a world in which interoperable altchains can be easily created and used, but without unnecessarily fragmenting markets and development….", "we argue it is possible to achieve these seemingly contradictory goals.", "The key insight is that Bitcoin the blockchain is conceptually independent of ‘bitcoin’ the asset.", "If we had technology to support the movement of assets between blockchains, new systems could be developed which users could adopt by simply reusing the existing Bitcoin currency.", "A principled manner of transferring assets between blockchains is introduced, the pegged sidechain.", "Sidechains are firewalled so that a problem in one sidechain does not affect other chains.", "…because sidechains are still blockchains independent of Bitcoin, they are free to experiment with new transaction designs, trust models, economic models, asset issuance semantics, or cryptographic features.", "and furthermore,  …these technologies can also be used in complementary currencies.", "Examples include community currencies, which are designed to preferentially boost local businesses; business barter associations, which support social programs like education or elderly care; and limited-purpose tokens which are used wihin organisations such as massive multiplayer games, loyalty programs, and online communities.", "Using pegged sidechains to manage in-game assets definitely sounds like an interesting area to me.", "The actual pegged sidechain mechanism is described in detail in the paper, which I encourage you to read (as always!).", "At the core is the idea of a DMMS:  We observe that Bitcoin’s blockheaders can be regarded as an example of a dynamic-membership multi-party signature (or DMMS), which we consider to be of independent interest as a new type of group signature.", "Unless you believe that Bitcoin as we know it today is the be-all and end-all of crypto-currencies and trustless distributed systems, then a mechanism that allows innovation to thrive on top without being held back by the necessary slow rate of change of Bitcoin itself is an important contribution.", "Related reading from previous editions of #themorningpaper:  Something a little different for today: \"Bitcoin: A peer to peer electronic cash system,\" Nakamoto.", "[url]"], "author_id": "ACOLYER", "pdf_url": "http://www.blockstream.com/sidechains.pdf", "author_full_name": "Adrian Colyer", "source_website": "https://blog.acolyer.org/about/", "id": 87460557}