{"blog_id": "identifying-impactful-service-system-problems-via-log-analysis", "summary": ["Identifying impactful service system problems via log analysis He et al., ESEC/FSE’18  If something is going wrong in your system, chances are you’ve got two main sources to help you detect and resolve the issue: logs and metrics.", "You’re unlikely to be able to get to the bottom of a problem using metrics alone (though you might well detect one that way), so that leaves logs as the primary diagnosis tool.", "The online service at Microsoft used as the main case study in the paper produces dozens of Terabytes of logs every day.", "Logs play a crucial role in the diagnosis of modern cloud-based online service systems.", "Clearly, manual problem diagnosis is very time-consuming and error-prone due to the increasing scale and complexity of large-scale systems.", "Log3C analyses logs to look for indications of impactful problems, using correlated KPIs as a guide.", "It finds these needles in the haystack with an average precision of 0.877 and an average recall of 0.883.", "A distributed version of Log3C has been deployed and used in production at Microsoft for several years, both to support a massive online service (we are not told which one), and integrated into “Product B” where it is used as a log analysis engine to analyse tens of billions of log messages every day.", "Log3C greatly reduces engineer’s efforts on manually inspecting the logs and pinpointing root causes of failures.", "Furthermore, fault patterns are also extracted and maintained for analyzing similar problems in the future.", "From the experiences thus gained in log analysis the authors draw the following lessons:  Simple anomaly / outlier detection doesn’t cut it.", "It’s tempting to believe that systems are regular most of the time, and therefore any outliers are problems, but in practice there’s can be a long tail of infrequent (but genuine) user behaviours.", "“Our experiences with the production system reveal that there are indeed many rare user behaviors, which are not real problems.", "A lot of effort could be wasted by examining these false positives.“  It’s not just a single incidence of a problem that’s important, but also the underlying trend in the number of incidences of that problem.", "Are the number of incidences steadily increasing over a period of time?", "That’s of interest.", "Have totally new problems appeared?", "That could be an indication of a buggy deployment.", "Do the number of incidences of problem decrease after a fix, but then settle down to a steady but non-zero level?", "This can indicate an incomplete fix or partial solution.", "To work its magic, Log3C combines both metrics and logs.", "KPIs are used to guide log analysis to focus on periods in time when we have external evidence of a system problem (e.g., the error rate is up).", "This helps to separate the long tail of genuine user behaviours from true problems.", "Then Log3C uses a novel clustering algorithm called Cascading Clusters in order to be able to effectively cluster the massive amounts of log data generated by the system.", "Problems are identified by looking for rare clusters correlated with KPI degradation.", "Clustering is made more difficult because logs are highly imbalanced – the vast majority of log entries are for regular non-problem behaviours.", "High level approach  Log3C consists of four steps: log parsing, sequence vectorization, cascading clustering, and correlation analysis.", "( Enlarge )  …at each time interval, logs are parsed into log events and vectorized into sequence vectors, which are then grouped into multiple clusters through cascading clustering.", "However, we still cannot extrapolate whether a cluster is an impactful problem, which necessitates the use of KPIs.", "Consequently, in step four, we correlate clusters and KPIs over different time intervals to find impactful problems.", "From log messages to sequence vectors  The first step is to turn log messages into log events (on the assumption you’re not logging as events already).", "For each log message such as “HTTP Request URL:  [url]"], "author_id": "ACOLYER", "pdf_url": "https://dl.acm.org/doi/pdf/10.1145/3236024.3236083?download=true", "author_full_name": "Adrian Colyer", "source_website": "https://blog.acolyer.org/about/", "id": 69502658}