{"blog_id": "ranzatocaz15", "summary": ["This paper is concerned with the problem of predicting a sequence at the output, e.g. using an RNN.", "It aims at addressing the issue it refers to as exposure bias, which here refers to the fact that while at training time the RNN producing the output sequence is being fed the ground truth previous tokens (words) when producing the next token (something sometimes referred to as teacher forcing, which really is just maximum likelihood), at test time this RNN makes predictions using recursive generation, i.e. it is instead recursively fed by its own predictions (which might be erroneous).", "Moreover, it also proposes a training procedure that can take into account a rich performance measure that can't easily be optimized directly, such as the BLEU score for text outputs.", "The key observation is that the REINFORCE algorithm could be used to optimize the expectation of such arbitrarily complicated performance measures, for outputs produced by (stochastic) recursive generation.", "However, REINFORCE is a notoriously unstable training algorithm, which can often work terribly (in fact, the authors mention that they have tried using REINFORCE only, without success).", "Thus, they instead propose to gradually go from training according to maximum likelihood / teacher forcing to training using the REINFORCE algorithm on the expected performance measure.", "The proposed procedure, dubbed MIXER (Mixed Incremental Cross-Entropy Reinforce), goes as follows: 1.", "Train model to optimize the likelihood of the target sequence, i.e. minimize the per time-step cross-entropy loss.", "2.", "Then, for a target sequence of size T, optimize the cross-entropy for the T-Δ first time steps of the sequence and use Reinforce to get a gradient on the expected loss (e.g. negative BLEU) for the recursive generation of the rest of the Δ time steps.", "3.", "Increase Δ and go back to 2., until Δ is equal to T.  Experiments on 3 text benchmarks (summarization, machine translation and image captioning) show that this approach yields models that produces much better outputs when not using beam search (i.e. using greedy recursive generation) to generate an output sequence, compared to other alternatives such as regular maximum likelihood and Data as Demonstrator (DaD).", "DaD is similar to the scheduled sampling method of Bengio et al. (see my note:  [ref] ), in that at training time, some of the previous tokens fed to the model are predicted tokens instead of ground truths.", "When using beam search, MIXER is only outperformed by DaD on the machine translation task."], "author_id": "hlarochelle", "pdf_url": "http://arxiv.org/pdf/1511.06732", "author_full_name": "Hugo Larochelle", "source_website": "https://www.shortscience.org/user?name=hlarochelle", "id": 53809041}