{"blog_id": "the-rise-of-the-citizen-developer-assessing-the-security-impact-of-online-app-generators", "summary": ["The rise of the citizen developer: assessing the security impact of online app generators Oltrogge et al., IEEE Security & Privacy 2018  “Low code”, “no code”, “citizen developers”, call it what you will, there’s been a big rise in platforms that seek to make it easy to develop applications for non-export developers.", "Today’s paper choice studies the online application generator (OAG) market for Android applications.", "When what used to be a web site (with many successful web site  templating and building options around) is often in many cases now also or instead a mobile app, so it makes sense that the same kind of templating and building approach should exist there too.", "For a brief period at the end of last year, Apple flirted with banning such apps from their app store , before back-tracking just a couple of weeks after the initial announcement.", "After reading today’s paper I can’t help but feel that perhaps they were on to something.", "Not that templated apps are bad per se, but when the generated apps contain widespread vulnerabilities and privacy issues, then that is bad.", "With the increasing use of OAGs the duty of generating secure code shifts away from the app developer to the generator service.", "This leaves the question of whether OAGs can provide save and privacy-preserving default implementations of common tasks to generate more secure apps at an unprecedented scale.", "Being an optimist by nature, my hope was that such app generation services would improve the state of security, because spending time and effort getting it right once would pay back across all of the generated apps.", "In theory that could still happen, but in practice it seems the opposite is occurring.", "It doesn’t seem to make a lot of difference whether you use a free online app generator (what are their incentives, and where does their revenue come from?", "Always good questions to ask), or a paid service, the situation is not good.", "The re-configuration attacks that the authors discover are particularly devastating.", "Online app generation services and penetration  Online application generators enable app development using wizard-like, point-and-click web interfaces in which developers only need to add and suitably interconnect UI elements that represent application components… There is no need and typically no option to write custom code.", "The authors started by searching the web for advertised online app generation platform, resulting in the set of services shown in the table below (the Como the authors refer to is I believe now called ‘swiftic’ –  [url]"], "author_id": "ACOLYER", "pdf_url": "https://saschafahl.de/papers/appgens2018.pdf", "author_full_name": "Adrian Colyer", "source_website": "https://blog.acolyer.org/about/", "id": 58874274}