{"blog_id": "large-scale-analysis-of-style-injection-by-relative-path-overwrite", "summary": ["Large-scale analysis of style injection by relative path overwrite Arshad et al., WWW’18  (If you don’t have ACM Digital Library access, the paper can be accessed either by following the link above directly from The Morning Paper blog site, or from the WWW 2018 proceedings page).", "We’ve all been fairly well trained to have good awareness of cross-site scripting (XSS) attacks.", "Less obvious, and also less well known, is that a similar attack is possible using style sheet injection.", "A good name for these attacks might be SSS: same-site style attacks.", "Even though style injection may appear less serious a threat than script injection, it has been shown that it enables a range of attacks, including secret exfiltration… Our work shows that around 9% of the sites in the Alexa top 10,000 contain at least one vulnerable page, out of which more than one third can be exploited.", "I’m going to break today’s write-up down into four parts:  How on earth do you do secret exfiltration with a stylesheet?", "Injecting stylesheet content using Relative Path Overwite (RPO)  Finding RPO vulnerabilities in the wild  How can you defend against RPO attacks?", "Secret exfiltration via stylesheets  Style sheet injection belongs to a family of attacks known as ‘scriptless’ attacks.", "While CSS is intended for controlling styling and layout, it does also contain some context-sensitive features that can be used to extract and exfiltrate data.", "Suppose a page contains some sensitive data you’d like to get your hands on.", "The first thing you need to do is make that visible if it was otherwise hidden (CSS attribute accessors and content properties will help with this).", "Once the content is visible, you can apply style directives to it, such as fonts…  Custom attacker-supplied fonts can change the size of the secret text depending on its value.", "Animation features can be used to cycle through a number of fonts in order to test different combinations.", "Media queries or the appearance of scrollbars can be used to implement conditional style, and data exfiltration by loading a different URL for each condition from the attacker’s server.", "Taken together, Heiderich et al. demonstrate that these techniques allow an attacker to steal credit card numbers or CSRF tokens without script execution.", "There are other attacks too, this is just one example.", "Helping the attacker is the fact that the CSS standard mandates browsers be forgiving when parsing CSS, skipping over parts they don’t understand.", "Against the attacker though, is the fact that modern browsers won’t load documents with non-CSS content types or syntax errors as stylesheets, if they come from a different domain than the including page.", "The Relative Path Overwrite (RPO) attack vector  If both the including page and the included stylesheet come from the same domain though, it’s game on.", "Relative Path Overwrite vulnerabilities allow an attacker to engineer this scenario.", "Consider a web page hosted at  [url]"], "author_id": "ACOLYER", "pdf_url": "https://dl.acm.org/doi/pdf/10.1145/3178876.3186090?download=true", "author_full_name": "Adrian Colyer", "source_website": "https://blog.acolyer.org/about/", "id": 45186835}