{"blog_id": "legoos-a-disseminated-distributed-os-for-hardware-resource-disaggregation", "summary": ["LegoOS: a disseminated, distributed OS for hardware resource disaggregation Shan et al., OSDI’18  One of the interesting trends in hardware is the proliferation and importance of dedicated accelerators as general purposes CPUs stopped benefitting from Moore’s law.", "At the same time we’ve seen networking getting faster and faster, causing us to rethink some of the trade-offs between local I/O and network access.", "The monolithic server as the unit of packaging for collections of such devices is starting to look less attractive:  It leads to inefficient resource utilisation, since CPU and memory for a job have to be allocated from the same machine.", "This can lead to eviction even when utilisation is overall low (e.g. 50%).", "It is difficult to add, move, remove, or reconfigure hardware components after they have been installed in a server, leading to long up-front planning cycles for hardware rollouts at odds with the fast-moving rate of change in requirements.", "It creates a coarse failure domain – when any hardware component within a server fails, the whole server is often unusable.", "It doesn’t work well with heterogeneous devices and their rollout: e.g. GPGPUs, TPUs, DPUs, FGPAs, NVM, and NVMe-based SSDs.", "To fully support the growing heterogeneity in hardware and to provide elasticity and flexibility at the hardware level, we should break the monolithic server model.", "We envision a hardware resource disaggregation model where hardware resources in traditional servers are disseminated into network-attached hardware components.", "Each component has a controller and a network interface, can operate on its own, and is an independent, failure-isolated entity.", "Hardware resource disaggregation is enabled by three hardware trends:  Rapidly growing networks speeds (e.g. 200 Gbps InfiniBand will be only 2-4x slower than the main memory bus in bandwidth).", "“With the main memory bus facing a bandwidth wall, future network bandwith (at line rate) is even projected to exceed local DRAM bandwidth” (just think about how many design assumptions that turns on their heads!).", "Network technologies such as Intel OmniPath, RDMA, and NVMe over Fabrics enable hardware devices to access the network directly without the need to attached any process.", "Hardware devices are incorporating more processing power, making it possible to offload more application and OS functionality to them.", "From a hardware perspective this seems to open up a bunch of exciting possibilities.", "But what on earth does an operating system look like in such a world?", "That’s the question this paper sets out to address, with the design of LegoOS.", "LegoOS distributes operating system functions across a collection of loosely-coupled monitors, each of which runs and manages a hardware component.", "The initial implementation goes after the big three: processing, memory, and storage.", "Yes, that does mean that processor and memory are separated over the network!", "The biggest challenge and our focus in building LegoOS is the separation of processor and memory and their management.", "Modern processors and OSes assume all hardware memory units including main memory, page tables, and TLB are local.", "Simply moving all memory hardware and memory management software to across the network will not work.", "LegoOS is available at  [url]"], "author_id": "ACOLYER", "pdf_url": "https://www.usenix.org/system/files/osdi18-shan.pdf", "author_full_name": "Adrian Colyer", "source_website": "https://blog.acolyer.org/about/", "id": 89767636}