{"blog_id": "mohamedr15", "summary": ["This paper presents a variational approach to the maximisation of mutual information in the context of a reinforcement learning agent.", "Mutual information in this context can provide a learning signal to the agent that is \"intrinsically motivated\", because it relies solely on the agent's state/beliefs and does not require from the (\"outside\") user an explicit definition of rewards.", "Specifically, the learning objective, for a current state s, is the mutual information between the sequence of K actions a proposed by an exploration distribution $w(a|s)$ and the final state s' of the agent after performing these actions.", "To understand what the properties of this objective, it is useful to consider the form of this mutual information as a difference of conditional entropies:  $$I(a,s'|s) = H(a|s) - H(a|s',s)$$  Where $I(.|.", ")$ is the (conditional) mutual information and $H(.|.", ")$ is the (conditional) entropy.", "This objective thus asks that the agent find an exploration distribution that explores as much as possible (i.e. has high $H(a|s)$ entropy) but is such that these actions have predictable consequences (i.e.", "lead to predictable state s' so that $H(a|s',s)$ is low).", "So one could think of the agent as trying to learn to have control of as much of the environment as possible, thus this objective has also been coined as \"empowerment\".", "The main contribution of this work is to show how to train, on a large scale (i.e. larger state space and action space) with this objective, using neural networks.", "They build on a variational lower bound on the mutual information and then derive from it a stochastic variational training algorithm for it.", "The procedure has 3 components: the exploration distribution $w(a|s)$, the environment $p(s'|s,a)$ (can be thought as an encoder, but which isn't modeled and is only interacted with/sampled from) and the planning model $p(a|s',s)$ (which is modeled and can be thought of as a decoder).", "The main technical contribution is in how to update the exploration distribution (see section 4.2.2 for the technical details).", "This approach exploits neural networks of various forms.", "Neural autoregressive generative models are also used as models for the exploration distribution as well as the decoder or planning distribution.", "Interestingly, the framework allows to also learn the state representation s as a function of some \"raw\" representation x of states.", "For raw states corresponding to images (e.g. the pixels of the screen image in a game), CNNs are used."], "author_id": "hlarochelle", "pdf_url": "http://papers.nips.cc/paper/5668-variational-information-maximisation-for-intrinsically-motivated-reinforcement-learning.pdf", "author_full_name": "Hugo Larochelle", "source_website": "https://www.shortscience.org/user?name=hlarochelle", "id": 63848470}