{"blog_id": "making-smart-contracts-smarter", "summary": ["Making smart contracts smarter Luu et al., CCS 2016  This is the fourth in a series of papers from the ACM Queue Research for Practice ‘ Cryptocurrencies, Blockchains and Smart Contracts ‘ selections, in which Luu at al.", "look at smart contracts in Ethereum.", "Smart contracts are a really intriguing idea and have generated a lot of interest/excitement, but they also have a number of properties which make them both likely targets for attackers and also hard to get right.", "Regular readers of The Morning Paper will not be surprised to see our old friend error and exception handling popping up as one of the chief causes of problems again!", "After scanning 19,366 Ethereum contracts using the OYENTE tool described in the paper, the authors found vulnerabilities in 8,833 of them.", "Here’s the plan: after a brief introduction to smart contracts, we’ll discuss what it is that makes them especially attractive targets, followed by a look at typical vulnerabilities.", "We’ll then finish up by seeing what we can do about the situation to make contracts more secure in the future.", "What exactly is a smart contract?", "A smart contract is identified by an address (a 160-bit identifier) and its code resides on the blockchain.", "Users invoke a smart contract in present cryptocurrencies by sending transactions to the contract address.", "Specifically, if a new transaction is accepted by the blockchain and has a contract address as the recipient, then all participants on the mining network execute the contract code with the current state of the blockchain and the transaction payloads as inputs.", "The network then agrees on the output and the next state of the contract by participating in a consensus protocol.", "In Ethereum, contracts are introduce to the blockchain via special creation transactions.", "Contracts are essentially functions whose Ethereum Virtual Machine (EVM) bytecode is incorporated in the blockchain as part of the creation transaction.", "The contracts themselves can be written in higher-level languages and compiled to EVM bytecode.", "Contract functions are stateful: they have private storage on the blockchain, and can also hold some amount of virtual Ether coins.", "The private storage is allocated and initialized by running a constructor, subsequent transactions sent to the contract address invoke the anonymous function.", "Here’s an example Puzzle contract:  Note the contract state declared on lines 2-6, constructor on lines 8-13, and anonymous transaction function on lines 15-29.", "A default input variable msg holds the sender, amount of Ether sent to the contract, and any included data as part of the invocation.", "In this particular contract, if the owner initiates the transaction (line 16) they can extract the current reward value and replace it with some other amount (lines 17-21).", "Anyone else invoking the transaction can submit a potential solution, and will receive the reward if the solution is accepted (lines 23-29).", "All miners execute the transaction, which will incur some computation cost:  Ethereum pays miners some fees proportional to the required computation.", "Specifically, each instruction in the Ethereum bytecode has a pre-specified amount of gas.", "When a user sends a transaction to invoke a contract, she has to specify how much gas she is willing to provide for the execution (called gasLimit) as well as the price for each gas unit (called gasPrice).", "A miner who includes the transaction in his proposed block subsequently receives the transaction fee corresponding to the amount of gas the execution actually burns multiplied by gasPrice.", "If the execution costs more than the gasLimit then execution is terminated and the state is restored to the initial state at the start of the function execution.", "The miner still receives gasLimit compensation though.", "Why are smart contracts attractive targets?", "Smart contracts have associated value – potentially handling large numbers of coins worth hundreds of dollars apiece.", "The 8,833 contracts in the first 1,460,000 blocks in the Ethereum network had a total balance of over 3 million Ether (about $30M USD) at the time the paper was written.", "The infamous attack on ‘TheDAO’ caused a loss of about $60M to TheDAO’s investors.", "Smart contract vulnerabilities  So we know that smart contracts have value as attack targets.", "They also have a combination of features that should make any experienced software developer raise an eyebrow:  They execute in permissionless networks which arbitrary participants can join (i.e., under byzantine conditions)  Miners and/or callers have meaningful control over the environment in which the transactions execute (which transactions to accept, transaction ordering, setting of block timestamp, manipulation of call stack)  All of the above must be reasoned about in an environment which punishes anyone who doesn’t get it right first time – there is no patching mechanism:  There is no way to patch a buggy smart contract, regardless of its popularity or how much money it has, without reversing the blockchain (a formidable task).", "Therefore, reasoning about the correctness of smart contracts before deployment is critical, as is designing a safe smart contract system.", "Note: you can explicitly design versioning/upgrade capabilities into your smart contract code, since contracts can call each other.", "See e.g.,  [url]"], "author_id": "ACOLYER", "pdf_url": "https://dl.acm.org/doi/pdf/10.1145/2976749.2978309?download=true", "author_full_name": "Adrian Colyer", "source_website": "https://blog.acolyer.org/about/", "id": 82387857}