{"blog_id": "weston16", "summary": ["This paper investigates different paradigms for learning how to answer natural language queries through various forms of feedback.", "Most interestingly, it investigates whether a model can learn to answer correctly questions when the feedback is presented purely in the form of a sentence (e.g. \"Yes, that's right\", \"Yes, that's correct\", \"No, that's incorrect\", etc.).", "This later form of feedback is particularly hard to leverage, since the model has to somehow learn that the word \"Yes\" is a sign of a positive feedback, but not the word \"No\".", "Normally, we'd trained a model to directly predict the correct answer to questions based on feedback provided by an expert that always answers correctly.", "\"Imitating\" this expert just corresponds to regular supervised learning.", "The paper however explores other variations on this learning scenario.", "Specifically, they consider 3 dimensions of variations.", "The first dimension of variation is who is providing the answers.", "Instead of an expert (who is always right), the paper considers the case where the model is instead observing a different, \"imperfect\" expert whose answers come from a fixed policy that answers correctly only a fraction of the time (the paper looked at 0.5, 0.1 and 0.01).", "Note that the paper refers to these answers as coming from \"the learner\" (which should be the model), but since the policy is fixed and actually doesn't depend on the model, I think one can also think of it as coming from another agent, which I'll refer to as the imperfect expert (I think this is also known as \"off policy learning\" in the RL world).", "The second dimension of variation on the learning scenario that is explored is in the nature of the \"supervision type\" (i.e. nature of the labels).", "There are 10 of them (see Figure 1 for a nice illustration).", "In addition to the real expert's answers only (Type 1), the paper considers other types that instead involve the imperfect expert and fall in one of the two categories below:  1.", "Explicit positive / negative rewards based on whether the imperfect expert's answer is correct.", "2.", "Various forms of natural language responses to the imperfect expert's answers, which vary from worded positive/negative feedback, to hints, to mentions of the supporting fact for the correct answer.", "Also, mixtures of the above are considered.", "Finally, the third dimension of variation is how the model learns from the observed data.", "In addition to the regular supervised learning approach of imitating the observed answers (whether it's from the real expert or the imperfect expert), two other distinct approaches are considered, each inspired by the two categories of feedback mentioned above:  1.", "Reward-based imitation: this simply corresponds to ignoring answers from the imperfect expert for which the reward is not positive (as for when the answers come from the regular expert, they are always used I believe).", "2.", "Forward prediction: this consists in predicting the natural language feedback to the answer of the imperfect expert.", "This is essentially treated as a classification problem over possible feedback (with negative sampling, since there are many possible feedback responses), that leverages a soft-attention architecture over the answers the expert could have given, which is also informed by the actual answer that was given (see Equation 2).", "Also, a mixture of both of these learning approaches is considered.", "The paper thoroughly explores experimentally all these dimensions, on two question-answering datasets (single supporting fact bAbI dataset and MovieQA).", "The neural net model architectures used are all based on memory networks.", "Without much surprise, imitating the true expert performs best.", "But quite surprisingly, forward prediction leveraging only natural language feedback to an imperfect expert often performs competitively compared to reward-based imitation.", "#### My two cents This is a very thought provoking paper!", "I very much like the idea of exploring how a model could learn a task based on instructions in natural language.", "This makes me think of this work  [ref]  on using zero-shot learning to learn a model that can produce a visual classifier based on a description of what must be recognized.", "Another component that is interesting here is studying how a model can learn without knowing a priori whether a feedback is positive or negative.", "This sort of makes me think of [this work]( [url]"], "author_id": "hlarochelle", "pdf_url": "http://arxiv.org/pdf/1604.06045", "author_full_name": "Hugo Larochelle", "source_website": "https://www.shortscience.org/user?name=hlarochelle", "id": 18521109}